# ----------------------------------------------------------------
# Решите в целых числах уравнение:
#
# (ax+b)^0.5=c
# a, b, c – данные целые числа: найдите все решения или сообщите, что решений в целых числах нет.
# ----------------------------------------------------------------


a = int(input())
b = int(input())
c = int(input())

if c < 0:
    print('NO SOLUTION')
elif a == b == c == 0:
    print('MANY SOLUTIONS')
else:
    x = (c ** 2 - b) / a
    if int(x) > (-b) / a:
        print('NO SOLUTION')
    else:
        print(int(x))
