# ----------------------------------------------------------
# Бригада скорой помощи выехала по вызову в один из отделенных районов. К сожалению,
# когда диспетчер получил вызов, он успел записать только адрес дома и номер квартиры K1, а
# затем связь прервалась. Однако он вспомнил, что по этому же адресу дома некоторое время
# назад скорая помощь выезжала в квартиру K2, которая расположена в подъезда P2 на этаже
# N2. Известно, что в доме M этажей и количество квартир на каждой лестничной площадке
# одинаково. Напишите программу, которая вычилсяет номер подъезда P1 и номер этажа N1
# квартиры K1.
# ----------------------------------------------------------

# K1 - квартира 1, М - количество этажей, К2 - квартира 2, P2 - номер подъезда 2, N2 - номер этажа 2

K1, M, K2, P2, N2 = int(input())

